Tekla Open API Reference for Tekla Structures 2025
DetailMarkSymbolAttributes Methods
The DetailMarkSymbolAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
See Also
Reference
DetailMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace